import React from "react";
import { Link } from "react-router-dom";

const Blog = () => {
  return (
    <section class="section blog-single">
      <div class="container">
        <div class="row">
          <div class="col-lg-12 offset-lg-1 col-12">
            <div className="post-details">
              <ul className="post-category">
                <li>
                  <Link href="#">اعمال</Link>
                </li>
              </ul>
              <h2 className="post-title">
                <Link href="#">
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                  توليد هذا النص.
                </Link>
              </h2>
              <ul className="custom-flex post-meta">
                <li>
                  <Link href="#">
                    <i className="icofont-calendar"></i>
                    24th March 2020
                  </Link>
                </li>
              </ul>
              <p>
                هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
                هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
                العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
                التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
                العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي
                أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه
                الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة
                حقيقية لتصميم الموقع..
              </p>
              <p>
                هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال
                نصاً بديلاً ومؤقتاً..
              </p>
              <div className="post-image animate-img">
                <Link href="#">
                  <img src="https://via.placeholder.com/1140x690" alt="#" />
                </Link>
              </div>
              <h3>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة</h3>
              <p>
                هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال
                نصاً بديلاً ومؤقتاً..
              </p>
              <h3>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة</h3>
              <p>
                هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال
                نصاً بديلاً ومؤقتاً..
              </p>
              <h3>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة</h3>
              <ul className="list">
                <li>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة.</li>
                <li>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة.</li>
                <li>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة</li>
                <li>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة.</li>
                <li>هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة</li>
              </ul>
              <p>
                هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال
                نصاً بديلاً ومؤقتاً..
              </p>
              <div className="middle-image">
                <div className="row">
                  <div className="col-lg-6 col-12">
                    <div className="blog-middle-image">
                      <img src="https://via.placeholder.com/500x500" alt="#" />
                    </div>
                  </div>
                  <div className="col-lg-6 col-12">
                    <p>
                      هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن
                      يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم.
                      لأنه مازال نصاً بديلاً ومؤقتاً..
                    </p>
                  </div>
                </div>
              </div>
              <p>
                هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال
                نصاً بديلاً ومؤقتاً..
              </p>

              
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Blog;
